app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `kategori_download`
SELECT COUNT(*) AS `numrows`
FROM `berita`
SELECT COUNT(*) AS `numrows`
FROM `download`
SELECT COUNT(*) AS `numrows`
FROM `slide`
SELECT COUNT(*) AS `numrows`
FROM `halaman`
SELECT COUNT(*) AS `numrows`
FROM `galeri`
SELECT COUNT(*) AS `numrows`
FROM `pesan_kontak`
SELECT COUNT(*) AS `numrows`
FROM `faq`
---
    public function admin()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }
        if ($session->get('role') !== 'admin') {
            return redirect()->to('/dashboard/' . $session->get('role'))->with('error', 'Anda tidak punya akses ke halaman ini.');
        }

        $userModel = new \App\Models\UserModel();
        $kategoriModel = new \App\Models\KategoriModel();
        $kategoriDownloadModel = new \App\Models\KategoriDownloadModel();
        $beritaModel = new \App\Models\BeritaModel();
        $downloadModel = new \App\Models\DownloadModel();
        $slideModel = new \App\Models\SlideModel();
        $halamanModel = new \App\Models\HalamanModel();
        $galeriModel = new \App\Models\GaleriModel();
        $pesanKontakModel = new \App\Models\PesanKontakModel();
        $faqModel = new \App\Models\FaqModel();

        // Statistik umum
        $jumlah_user = $userModel->countAllResults();
        $jumlah_kategori = $kategoriModel->countAllResults();
        $jumlah_kategori_download = $kategoriDownloadModel->countAllResults();
        $jumlah_berita = $beritaModel->countAllResults();
        $jumlah_download = $downloadModel->countAllResults();
        $jumlah_slide = $slideModel->countAllResults();
        $jumlah_halaman = $halamanModel->countAllResults();
        $jumlah_galeri = $galeriModel->countAllResults();
        $jumlah_pesan = $pesanKontakModel->countAllResults();
        $jumlah_faq = $faqModel->countAllResults();

SELECT COUNT(*) as jumlah, DATE_FORMAT(created_at, '%Y-%m') as bulan
FROM `berita`
GROUP BY `bulan`
ORDER BY `bulan` ASC
---
        $pesan_statistics = $pesanKontakModel->getStatistics();

        // Grafik berita per bulan
        $grafik_berita = $beritaModel->select("COUNT(*) as jumlah, DATE_FORMAT(created_at, '%Y-%m') as bulan")
            ->groupBy('bulan')
            ->orderBy('bulan', 'ASC')
            ->findAll();

SELECT COUNT(*) as jumlah, DATE_FORMAT(created_at, '%Y-%m') as bulan
FROM `download`
GROUP BY `bulan`
ORDER BY `bulan` ASC
---
        }

        // Grafik download per bulan
        $grafik_download = $downloadModel->select("COUNT(*) as jumlah, DATE_FORMAT(created_at, '%Y-%m') as bulan")
            ->groupBy('bulan')
            ->orderBy('bulan', 'ASC')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `slide`
WHERE `status` = 'aktif'
SELECT COUNT(*) AS `numrows`
FROM `slide`
WHERE `status` = 'nonaktif'
---
        }

        // Statistik slide berdasarkan status
        $slide_aktif = $slideModel->where('status', 'aktif')->countAllResults();
        $slide_nonaktif = $slideModel->where('status', 'nonaktif')->countAllResults();

SELECT *
FROM `pesan_kontak`
ORDER BY `tanggal_kirim` DESC
 LIMIT 5
---
        $galeri_terbaru = $galeriModel->getLatest(5);

        // Pesan kontak terbaru
        $pesan_terbaru = $pesanKontakModel->orderBy('tanggal_kirim', 'DESC')->findAll(5);