app/Controllers/Frontend.php

SELECT *
FROM `kategori_download`
---
    public function index()
    {
        try {
            $slideModel = new \App\Models\SlideModel();
            $beritaModel = new \App\Models\BeritaModel();
            $galeriModel = new \App\Models\GaleriModel();
            $profilModel = new \App\Models\ProfilModel();
            $statsModel = new \App\Models\StatsModel();
            $halamanModel = new \App\Models\HalamanModel();
            $kategoriDownloadModel = new \App\Models\KategoriDownloadModel();
            $kategoris = $kategoriDownloadModel->findAll() ?? [];

SELECT *
FROM `kategori_download`
---
    public function halaman($slug)
    {
        try {
            $halamanModel = new \App\Models\HalamanModel();
            $profilModel = new \App\Models\ProfilModel();
            $kategoriDownloadModel = new \App\Models\KategoriDownloadModel();
            $kategoris = $kategoriDownloadModel->findAll() ?? [];

SELECT *
FROM `kategori_download`
---
    public function download()
    {
        try {
            $downloadModel = new \App\Models\DownloadModel();
            $kategoriDownloadModel = new \App\Models\KategoriDownloadModel();
            $subKategoriDownloadModel = new \App\Models\SubkategoriDownloadModel();
            $profilModel = new \App\Models\ProfilModel();

            $search = $this->request->getGet('search');
            $kategori = $this->request->getGet('kategori');
            $sub_kategori = $this->request->getGet('sub_kategori');
            $page = $this->request->getGet('page') ?: 1;

            $search = trim($search ?? '');
            $kategori = trim($kategori ?? '');
            $sub_kategori = trim($sub_kategori ?? '');
            $page = max(1, intval($page));

            // Ambil semua kategori dengan sub kategori
            $kategoris = $kategoriDownloadModel->findAll() ?? [];

SELECT *
FROM `kategori_download`
---
    public function contact()
    {
        try {
            $profilModel = new \App\Models\ProfilModel();
            $faqModel = new \App\Models\FaqModel();
            $kategoriDownloadModel = new \App\Models\KategoriDownloadModel();
            $kategoris = $kategoriDownloadModel->findAll() ?? [];