app/Controllers/Halaman.php

    public function index()
    {
        // Cek login dan role admin
        if (!session()->get('logged_in') || session()->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $data = [
            'title' => 'Kelola Halaman',
            'halaman' => $this->halamanModel->findAll()
---
SELECT *
FROM `halaman`

        }

        try {
            $result = $this->halamanModel->update($id, $data);
---
UPDATE `halaman` SET `judul` = 'Sejarah Biddokkes', `slug` = 'sejarah', `konten` = '<h2>Sejarah Biddokkes POLRI</h2>\r\n\r\n<p>Biddokkes POLRI memiliki sejarah panjang dalam memberikan layanan kesehatan bagi anggota Polri dan masyarakat Indonesia.</p>\r\n\r\n<h3>Awal Mula</h3>\r\n\r\n<p>Biddokkes POLRI didirikan dengan tujuan untuk memberikan layanan kesehatan yang berkualitas bagi anggota Polri dalam menjalankan tugasnya.</p>\r\n\r\n<h3>Perkembangan</h3>\r\n\r\n<p>Seiring berjalannya waktu, Biddokkes POLRI terus berkembang dan meningkatkan layanan kesehatannya untuk memberikan pelayanan terbaik.</p>\r\n\r\n<h3>Pencapaian</h3>\r\n\r\n<p>Biddokkes POLRI telah berhasil memberikan layanan kesehatan yang berkualitas dan terpercaya selama bertahun-tahun.</p>\r\n', `penulis` = 'Administrator', `tanggal_publish` = '2024-01-01', `updated_at` = '2025-08-02 17:19:52'
WHERE `halaman`.`id_halaman` IN ('2')