app/Models/BeritaModel.php

SELECT `berita`.*, `kategori`.`nama_kategori`
FROM `berita`
JOIN `kategori` ON `kategori`.`id_kategori` = `berita`.`id_kategori`
ORDER BY `berita`.`created_at` DESC
---
    public function getBeritaWithKategori()
    {
        return $this->select('berita.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = berita.id_kategori')
                    ->orderBy('berita.created_at', 'DESC')
                    ->findAll();

SELECT `berita`.*, `kategori`.`nama_kategori`
FROM `berita`
JOIN `kategori` ON `kategori`.`id_kategori` = `berita`.`id_kategori`
ORDER BY `berita`.`created_at` DESC
 LIMIT 5
---
    public function getLatest($limit = 10)
    {
        return $this->select('berita.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = berita.id_kategori')
                    ->orderBy('berita.created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();

SELECT `berita`.*, `kategori`.`nama_kategori`
FROM `berita`
JOIN `kategori` ON `kategori`.`id_kategori` = `berita`.`id_kategori`
WHERE   (
`berita`.`judul` LIKE '%institut bakti nusantara%' ESCAPE '!'
OR  `berita`.`isi` LIKE '%institut bakti nusantara%' ESCAPE '!'
 )
ORDER BY `berita`.`created_at` DESC
 LIMIT 5
---
    public function search($keyword, $limit = 5)
    {
        return $this->select('berita.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = berita.id_kategori')
                    ->groupStart()
                    ->like('berita.judul', $keyword)
                    ->orLike('berita.isi', $keyword)
                    ->groupEnd()
                    ->orderBy('berita.created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();