app/Models/DownloadModel.php

SELECT `download`.*, `sub_kategori_download`.`nama_sub_kategori_download`, `kategori_download`.`nama_kategori_download`
FROM `download`
JOIN `sub_kategori_download` ON `sub_kategori_download`.`id_sub_kategori_download` = `download`.`id_sub_kategori_download`
JOIN `kategori_download` ON `kategori_download`.`id_kategori_download` = `sub_kategori_download`.`id_kategori_download`
ORDER BY `download`.`created_at` DESC
---
    public function getDownloadWithKategori()
    {
        return $this->select('download.*, sub_kategori_download.nama_sub_kategori_download, kategori_download.nama_kategori_download')
                    ->join('sub_kategori_download', 'sub_kategori_download.id_sub_kategori_download = download.id_sub_kategori_download')
                    ->join('kategori_download', 'kategori_download.id_kategori_download = sub_kategori_download.id_kategori_download')
                    ->orderBy('download.created_at', 'DESC')
                    ->findAll();

SELECT `download`.*, `kategori_download`.`nama_kategori_download`
FROM `download`
JOIN `kategori_download` ON `kategori_download`.`id_kategori_download` = `download`.`id_kategori_download`
ORDER BY `download`.`hits` DESC
 LIMIT 5
---
    public function getPopularDownloads($limit = 10)
    {
        return $this->select('download.*, sub_kategori_download.nama_sub_kategori_download, kategori_download.nama_kategori_download')
                    ->join('sub_kategori_download', 'sub_kategori_download.id_sub_kategori_download = download.id_sub_kategori_download')
                    ->join('kategori_download', 'kategori_download.id_kategori_download = sub_kategori_download.id_kategori_download')
                    ->orderBy('download.hits', 'DESC')
                    ->limit($limit)
                    ->findAll();

SELECT `download`.*, `kategori_download`.`nama_kategori_download`
FROM `download`
JOIN `kategori_download` ON `kategori_download`.`id_kategori_download` = `download`.`id_kategori_download`
WHERE   (
`download`.`judul` LIKE '%institut bakti nusantara%' ESCAPE '!'
OR  `download`.`deskripsi` LIKE '%institut bakti nusantara%' ESCAPE '!'
 )
ORDER BY `download`.`created_at` DESC
 LIMIT 5
---
    public function searchDownload($keyword)
    {
        return $this->select('download.*, sub_kategori_download.nama_sub_kategori_download, kategori_download.nama_kategori_download')
                    ->join('sub_kategori_download', 'sub_kategori_download.id_sub_kategori_download = download.id_sub_kategori_download')
                    ->join('kategori_download', 'kategori_download.id_kategori_download = sub_kategori_download.id_kategori_download')
                    ->like('download.judul', $keyword)
                    ->orLike('download.deskripsi', $keyword)
                    ->orderBy('download.created_at', 'DESC')
                    ->findAll();