app/Models/HalamanModel.php

    public function getHalamanBySlug($slug)
    {
        if (empty($slug)) {
            return null;
        }

        return $this->where('slug', $slug)
                    ->where('tanggal_publish <=', date('Y-m-d'))
                    ->first();
---
SELECT *
FROM `halaman`
WHERE `slug` = 'profil'
AND `tanggal_publish` <= '2025-07-23'
 LIMIT 1

    public function getPublishedHalaman()
    {
        return $this->where('tanggal_publish <=', date('Y-m-d'))
                    ->orderBy('tanggal_publish', 'DESC')
                    ->findAll();
---
SELECT *
FROM `halaman`
WHERE `tanggal_publish` <= '2025-07-23'
ORDER BY `tanggal_publish` DESC

    public function isSlugExists($slug, $excludeId = null)
    {
        if (empty($slug)) {
            return false;
        }

        $query = $this->where('slug', $slug);
        if ($excludeId) {
            $query->where('id_halaman !=', $excludeId);
        }
        return $query->first() !== null;
---
SELECT *
FROM `halaman`
WHERE `slug` = 'sejarah'
AND `id_halaman` != '2'
 LIMIT 1