app/Models/HalamanModel.php

SELECT *
FROM `halaman`
WHERE `slug` = 'profil'
 LIMIT 1
---
    public function getHalamanBySlug($slug)
    {
        return $this->where('slug', $slug)->first();

SELECT *
FROM `halaman`
WHERE   (
`judul` LIKE '%institut bakti nusantara%' ESCAPE '!'
OR  `konten` LIKE '%institut bakti nusantara%' ESCAPE '!'
 )
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function search($keyword, $limit = 5)
    {
        return $this->groupStart()
                    ->like('judul', $keyword)
                    ->orLike('konten', $keyword)
                    ->groupEnd()
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();