app/Models/SubkategoriDownloadModel.php

SELECT *
FROM `sub_kategori_download`
WHERE `id_kategori_download` = '1'
ORDER BY `nama_sub_kategori_download` ASC
---
    public function getByKategoriId($id_kategori_download)
    {
        return $this->where('id_kategori_download', $id_kategori_download)
                    ->orderBy('nama_sub_kategori_download', 'ASC')
                    ->findAll();